
namespace ItsukiSumeragi.Codes.Flow
{
    /// <summary>
    /// 车辆类型
    /// </summary>
    public enum CarType
    {
        轿车=1,
        越野车=2,
        商务车=3,
        小型货车=4,
        大型货车=5,
        轻客=6,
        小型客车=7,
        大型客车=8,
        三轮车=9,
        微面=10,
        皮卡车=11,
        挂车=12,
        混凝土搅拌车=13,
        罐车=14,
        随车吊=15,
        消防车=16,
        渣土车=17,
        押运车=18,
        工程抢修车=19,
        救援车=20,
        栏板卡车=21,
        二轮车=22,
        自行车=23,
        行人=24,
        小型栏板=25,
        轻卡=26,
        危化品车=27
    }
}
