
namespace ItsukiSumeragi.Codes.Flow
{
    /// <summary>
    /// 车牌类型
    /// </summary>
    public enum PlateType
    {
        大型汽车号牌 = 1,
        小型汽车号牌 = 2,
        使馆汽车号牌 = 3,
        领馆汽车号牌 = 4,
        境外汽车号牌 = 6,
        两_三轮摩托车号牌 = 7,
        轻便摩托车号牌 = 8,
        使馆摩托车号牌 = 9,
        领馆摩托车号牌 = 10,
        境外摩托车号牌 = 11,
        外籍摩托车号牌 = 12,
        农用运输车号牌 = 13,
        拖拉机号牌 = 14,
        挂车号牌 = 15,
        教练汽车号牌 = 16,
        教练摩托车号牌 = 17,
        试验汽车号牌 = 18,
        试验摩托车号牌 = 19,
        临时入境汽车号牌 = 20,
        临时入境摩托车号牌 = 21,
        临时行驶车号牌 = 22,
        警用汽车号牌 = 23,
        警用摩托号牌 = 24,
        原农机号牌 = 25,
        港籍 = 26,
        澳籍 = 27,
        武警 = 31,
        军车 = 32,
        小型新能源车牌 = 34,
        大型新能源车牌 = 35,
        其它号牌 = 99
    }
}
